#include <stdio.h>
 
// 100을 인쇄하는 f1 함수의 parameter를 설계하라
// 함수에서 main 함수의 a 배열에 있는 100을 인쇄하기 위한 코드를 설계하라
 
 
void f1(int * p)
{//p == a[0][1]
    printf("%d\n", p[17]);//a[1][2][1] == a[0][1][1+12+4] == a[0][1][17] == p[17]
}
 
void main(void)
{
    int a[2][3][4] = { {{1,2,3,4},{5,6,7,8},{9,10,11,12}},
                        {{10,20,30,40},{50,60,70,80},{90,100,110,120}} };
    f1(*(a[0] + 1));//*(a[0] + 1) == a[0][1] type : int *
}
/**************************************************************
    Problem: 6638
    Language: C
    Result: Accepted
    Time:12 ms
    Memory:1048 kb
****************************************************************/

#include <stdio.h>
 
// 100을 인쇄하는 f2 함수의 parameter를 설계하라
// 함수에서 main 함수의 a 배열에 있는 100을 인쇄하기 위한 코드를 설계하라 
 
void f2(int (*p)[4])
{//p = a[2]
    printf("%d\n", p[-1][1]);//a[1][2][1] == a[2][2][-11] == p[2][-11]
    //a[1][2][1] == a[2][-1][1] == p[-1][1]
}
 
void main(void)
{
    int a[2][3][4] = { {{1,2,3,4},{5,6,7,8},{9,10,11,12}},{{10,20,30,40},{50,60,70,80},{90,100,110,120}} };
    f2(*(a + 2));//a[2] type : int (*)[4]
}
/**************************************************************
    Problem: 6639
    Language: C
    Result: Accepted
    Time:7 ms
    Memory:1048 kb
****************************************************************/


#include <stdio.h>
 
// 100을 인쇄하는 f3 함수의 parameter를 설계하라
// 함수에서 main 함수의 a 배열에 있는 100을 인쇄하기 위한 코드를 설계하라 
 
void f3(int (*p)[3][4])
{//p == a
    printf("%d\n", p[1][2][1]);//a[1][2][1] == p[1][2][1]
}
 
void main(void)
{
    int a[2][3][4] = { {{1,2,3,4},{5,6,7,8},{9,10,11,12}},{{10,20,30,40},{50,60,70,80},{90,100,110,120}} };
    f3(a);//a type : int (*)[3][4]
}
/**************************************************************
    Problem: 6640
    Language: C
    Result: Accepted
    Time:15 ms
    Memory:1048 kb
****************************************************************/



#include <stdio.h>
 
// 100을 인쇄하는 f4 함수의 parameter를 설계하라
// 함수에서 main 함수의 a 배열에 있는 100을 인쇄하기 위한 코드를 설계하라 
 
void f4(int (*p)[3][4])
{//p == a+3 => p-3 == a+3-3 == a
    printf("%d\n", p[-2][2][1]);//a[1][2][1] == (p-3)[1][2][1] == p[-2][2][1]
}
 
void main(void)
{
    int a[2][3][4] = { {{1,2,3,4},{5,6,7,8},{9,10,11,12}},{{10,20,30,40},{50,60,70,80},{90,100,110,120}} };
    f4(a + 3);//a type : int (*)[3][4]
}
/**************************************************************
    Problem: 6641
    Language: C
    Result: Accepted
    Time:15 ms
    Memory:1048 kb
****************************************************************/



#include <stdio.h>
 
// 100을 인쇄하는 f5 함수의 parameter를 설계하라
// 함수에서 main 함수의 a 배열에 있는 100을 인쇄하기 위한 코드를 설계하라 
 
void f5(int (*p)[2][3][4])
{//p == &a ==> *p == *&a == a
    printf("%d\n", p[0][1][2][1]);//a[1][2][1] == (*p)[1][2][1] == p[0][1][2][1]
}
 
void main(void)
{
    int a[2][3][4] = { {{1,2,3,4},{5,6,7,8},{9,10,11,12}},{{10,20,30,40},{50,60,70,80},{90,100,110,120}} };
    f5(&a);//&a type : int (*)[2][3][4]
}
/**************************************************************
    Problem: 6642
    Language: C
    Result: Accepted
    Time:9 ms
    Memory:1048 kb
****************************************************************/



#include <stdio.h>
 
// 100을 인쇄하는 f6 함수의 parameter를 설계하라
// 함수에서 main 함수의 a 배열에 있는 100을 인쇄하기 위한 코드를 설계하라 
 
void f6(int (*p)[2][3][4])
{//p == &a-1 ==> p+1==&a-1+1==&a ==> p[1] == *(p+1) == *(&a-1+1) == *&a == a
    printf("%d\n", p[1][1][2][1]);//a[1][2][1] == p[1][1][2][1]
}
 
void main(void)
{
    int a[2][3][4] = { {{1,2,3,4},{5,6,7,8},{9,10,11,12}},{{10,20,30,40},{50,60,70,80},{90,100,110,120}} };
    f6(&a - 1);//&a type : int (*)[2][3][4]
}
/**************************************************************
    Problem: 6643
    Language: C
    Result: Accepted
    Time:15 ms
    Memory:1048 kb
****************************************************************/
