#include <stdio.h>
 
int a[2][3] = { {1,2,3},{4,5,6} };
int b[2][3] = { {10,20,30},{40,50,60} };
int(*c[2])[3] = { b, a };
int(**p)[3] = c;
 
// 다음 함수의 리턴 타입을 완성하라
int (*f1(void))[3]
{
    return c[1];//*c type : int(*)[3]
}
 
void main(void)
{
    // 함수에서 복귀한 후 결과를 이용하여 a 배열에 있는 6을 인쇄하는 코드를 완성하라
    printf("6=%d\n", f1()[1][2]);//a[1][2] == f1()[1][2]
    //f1() == c[1] == a
}
/**************************************************************
    Problem: 6644
    Language: C
    Result: Accepted
    Time:12 ms
    Memory:1048 kb
****************************************************************/


#include <stdio.h> 
 
int a[2][3] = { {1,2,3},{4,5,6} };
int b[2][3] = { {10,20,30},{40,50,60} };
int(*c[2])[3] = { b, a };
int(**p)[3] = c;
 
// 다음 함수의 리턴 타입을 완성하라 
int (**f2(void))[3]
{
    return c + 1;//c type : int(**)[3]
}
 
void main(void)
{
    // 함수에서 복귀한 후 결과를 이용하여 a 배열에 있는 6을 인쇄하는 코드를 완성하라 
    printf("6=%d\n", f2()[0][1][2]);//a[1][2] == (*f2())[1][2] == f2()[0][1][2]
    //f2() == c+1 ==> *f2() == *(c+1) == c[1] == a
}
/**************************************************************
    Problem: 6645
    Language: C
    Result: Accepted
    Time:0 ms
    Memory:1048 kb
****************************************************************/


#include <stdio.h> 
 
int a[2][3] = { {1,2,3},{4,5,6} };
int b[2][3] = { {10,20,30},{40,50,60} };
int(*c[2])[3] = { b, a };
int(**p)[3] = c;
 
// 다음 함수의 리턴 타입을 완성하라  
int *f3(void)
{
    return a[0] - 1;//*a type : int *
}
 
void main(void)
{
    // 함수에서 복귀한 후 결과를 이용하여 a 배열에 있는 6을 인쇄하는 코드를 완성하라 
    printf("6=%d\n", f3()[6]);//a[1][2] == a[0][2+3] == a[0][5] == (f3()+1)[5] == f3()[6]
    //f3() == a[0]-1 ==> f3()+1 == a[0]-1+1 == a[0]
}
/**************************************************************
    Problem: 6646
    Language: C
    Result: Accepted
    Time:4 ms
    Memory:1048 kb
****************************************************************/



#include <stdio.h> 
 
int a[2][3] = { {1,2,3},{4,5,6} };
int b[2][3] = { {10,20,30},{40,50,60} };
int(*c[2])[3] = { b, a };
int(**p)[3] = c;
 
// 다음 함수의 리턴 타입을 완성하라  
int (**f4(void))[3]
{
    return p;//p type : int(**)[3]
}
 
void main(void)
{
    // 함수에서 복귀한 후 결과를 이용하여 a 배열에 있는 6을 인쇄하는 코드를 완성하라 
    printf("6=%d\n", f4()[1][1][2]);//a[1][2] == f4()[1][1][2]
    //f4() == p == c ==> f4()[1] == c[1] == a
}
/**************************************************************
    Problem: 6647
    Language: C
    Result: Accepted
    Time:0 ms
    Memory:1048 kb
****************************************************************/



#include <stdio.h> 
 
int a[2][3] = { {1,2,3},{4,5,6} };
int b[2][3] = { {10,20,30},{40,50,60} };
int(*c[2])[3] = { b, a };
int(**p)[3] = c;
 
// 다음 함수의 리턴 타입을 완성하라  
int (*(*f5(void))[2])[3]
{
    return &c;//&c type : int(*(*)[2])[3]
}
 
void main(void)
{
    // 함수에서 복귀한 후 결과를 이용하여 a 배열에 있는 6을 인쇄하는 코드를 완성하라 
    printf("6=%d\n", f5()[0][1][1][2]);//a[1][2] == (*f5())[1][1][2] == f5()[0][1][1][2]
    //f5() == &c ==> *f5() == *&c == c ==> a == c[1] == (*f5())[1]
}
/**************************************************************
    Problem: 6648
    Language: C
    Result: Accepted
    Time:15 ms
    Memory:1048 kb
****************************************************************/
